# NominalDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSize..::..NominalDiameter Property
MEPSize Class See Also
---
Nominal diameter
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double NominalDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NominalDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double NominalDiameter {
	double get ();
}
```

# See Also
MEPSize Class
Autodesk.Revit.DB Namespace